<?php

/**
 * This file is an error description file.
 *
 * All errors in the system will be described here
 * The returned content is processed through the multilingual module
 */

return [
    0 => 'success',

    800001 => '账号密码错误', // 账号密码错误
    800002 => '账号密码错误', // 账号密码错误
    800003 => '账号密码错误', // 账号密码错误
    800004 => '用户登录过期', // 用户登录过期
    800005 => '投稿内容不能为空', // 投稿内容不能为空
    800006 => '活动信息不存在', // 活动信息不存在
    800007 => '活动已经完成，无法变更', // 活动已经完成，无法变更
    800008 => '盲盒不存在', // 盲盒不存在
    800009 => '盲盒已经被其他用户绑定', // 盲盒已经被其他用户绑定

    900001 => '接口请求错误', // 接口请求错误
    900002 => '接口请求错误', // 接口请求错误
    900003 => '接口请求错误', // 接口请求错误
];
